local packCfg = {
    [3001]={    --登陆
        c = {
            {"platformId", "int32"}
            ,{"accountId", "string"}
            ,{"serverId", "int16"}
            ,{"md5", "string"}
            ,{"os", "int8"}          -- 手机系统 1-android 2-越狱ios 3-正版ios 0-未知
            ,{"osVersion", "string"} -- 具体型号: 比如 htcxxxxx
			,{"relogin","int8"}      -- 0表示登陆   1表示重连
            ,{"channel", "string"}   -- 渠道(只有在角色创建的时候有用)
		},
        s = {
            {"result", "int16"}  -- 登陆结果 登陆失败 没有账号, 封号....   成功不返回  直接到3003消息
		}
	}
    ,[3002]={   --创建角色
        c = {
            {"name", "string"}
        },
        s = {
            {"result", "int16"}
        }
    }
    ,[3003]={ -- 服务端数据加载完成
        s = {}
    }

    ,[3004]={ -- 客户端资源加载完成
        c = {},
        s = {
            {"roleInfo", "role"}
        }
    }
    ,[3005]={ -- 获取服务器时间
        c = {},
        s = {
            {"nowTime", "int32"}
        }
    }
	,[3006]={ -- 断线 不能重连
        s = {
            -- 1 - 异地登录 
            -- 2 - 停服中 
            -- 3 - 太多人了 
            -- 4 - 战斗验证失败 
            -- 5 - 禁止登录 
            -- 6 - 后台强制下线
            -- 7 - 登录验证失败
            -- 8 - 玩家主动离开
            -- 9 - 协议出错
            -- 10 - 服务器还没有对外开放
            {"type", "uint8"}
            -- 10 - 剩余开放时间
			--11  --socket 太久没反应
            -- 其他 - 无效
            ,{"extra", "int32"}     
        }
    }
    ,[3008] = { -- 客户端请求下线
        c = {}
    }
	,[3009] = {   --心跳包
		c ={}
	}
	,[3011] = {   --充值回调地址, 
		s ={
			{"payUrl", "string"}
		}
	}
    ,[3015] = {   -- 阵营选择， 如果有这个协议要选择阵营
        s = {},
    }
    ,[3016] = {
        c = {
            {"realm", "int8"}   -- 0-自动选择 1-北约 2-苏联
        },
        s = {
            {"result", "int16"},    -- 阵营选择错误码
            {"realm", "int8"}       -- 所选择的阵营
        }
    }
}


return packCfg
